In [3]:
import pandas as pd
import numpy as np

In [4]:
#1. Define the Pandas/Python pandas?
'''pandas is a python library which will provide you task related to data manupalation'''

'pandas is a python library which will provide you task related to data manupalation'

#What are the different types of Data Structures in Pandas?
1) Series
2) DataFrame
3) Panel (Removed from latest version)

In [5]:
#3. Explain Series and DataFrame In Pandas
'Series:series is a creation of contiguous memory locations or series of data items in the file'
'DataFrame:DataFrame is '

'DataFrame:DataFrame is '

In [6]:
#4.How Can You Create An Empty DataFrame and series in Pandas?
df = pd.DataFrame()
print(type(df))
ser = pd.Series()
print(type(ser))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [7]:
#5.How to check an empty DataFrame?

In [8]:
#6.What Are The Most Important Features Of The Pandas Library?

In [9]:
#7.How Will You Explain Reindexing In Pandas?

In [10]:
#9.Create a DataFrame using List
ls = [[1,9,7,10,3,6],[1,5,3,10,7,4]]
df = pd.DataFrame(ls,index=[1,2])
df

   0  1  2   3  4  5
1  1  9  7  10  3  6
2  1  5  3  10  7  4

In [11]:
#10.Create a DataFrame using Numpy Functions.
df = np.array([[1,2,6,9,7],[7,3,1,0,4]])
df1 = pd.DataFrame(df)
df1

   0  1  2  3  4
0  1  2  6  9  7
1  7  3  1  0  4

In [12]:
#11.How to convert a NumPy array to a DataFrame of a given shape?
df3 = pd.DataFrame(df,(1,2))
df3

   0  1  2  3  4
1  1  2  6  9  7
2  7  3  1  0  4

In [13]:
#12.Create a DataFrame using Dictionary with a list and arrays
dict = {'list': [1,3,7,9,5],
        'array': np.array([1,3,4,9,1])}
dict_df = pd.DataFrame(dict)
dict_df

   list  array
0     1      1
1     3      3
2     7      4
3     9      9
4     5      1

In [14]:
#13.How To Create A Copy Of The Series and DataFrame in Pandas?
series = pd.Series([1,4.3,4.6,1.0,7.5])
s_copy= series.copy()
print(f"series is \n {series}")
print(f"copy of the series is \n {s_copy}")
dataframe = pd.DataFrame(np.ones(3))
df_copy = dataframe.copy()
print(f"DataFrame is \n {dataframe}")
print(f"copy of the DataFrame is \n {df_copy}")

series is
 0    1.0
1    4.3
2    4.6
3    1.0
4    7.5
dtype: float64
copy of the series is
 0    1.0
1    4.3
2    4.6
3    1.0
4    7.5
dtype: float64
DataFrame is
      0
0  1.0
1  1.0
2  1.0
copy of the DataFrame is
      0
0  1.0
1  1.0
2  1.0

In [15]:
#14. How Will You Add An Index, Row, Or Column To A DataFrame In Pandas?
df = pd.DataFrame({'Name': ['ABC','XYZ','PQR','STU','ZOP'],'roll_no':[102,103,104,105,106]},index = [1,2,3,4,5])
print(df)
df.insert(2,'Mob',[55,66,33,11,44])
df

  Name  roll_no
1  ABC      102
2  XYZ      103
3  PQR      104
4  STU      105
5  ZOP      106

  Name  roll_no  Mob
1  ABC      102   55
2  XYZ      103   66
3  PQR      104   33
4  STU      105   11
5  ZOP      106   44

In [16]:
#.What Method Will You Use To Rename The Index Or Columns Of Pandas DataFrame?
df = pd.DataFrame({"A":[1,2,6.9,4,6],"B":[4,3,1,9,7]})
print(df)
df.rename(columns={"A" : "a", "B": "b"})
df.rename(index={0 :"x", 1:"y" , 2:"z", 3 :"p", 4:"q"})

     A  B
0  1.0  4
1  2.0  3
2  6.9  1
3  4.0  9
4  6.0  7

     A  B
x  1.0  4
y  2.0  3
z  6.9  1
p  4.0  9
q  6.0  7

In [17]:
#16.How Can You Iterate Over DataFrame In Pandas?
df = pd.DataFrame([[1,2,3,4,5],[1,2,3,8,9]])
rows = next(df.iterrows())
rows
columns = next(df.itertuples())
columns

Pandas(Index=0, _1=1, _2=2, _3=3, _4=4, _5=5)

In [18]:
#17.How to create an array from DataFrame
arr_df = pd.DataFrame([1,2,3,5,7])
array =  np.array(arr_df)
array

array([[1],
       [2],
       [3],
       [5],
       [7]])

In [19]:
#How to create a list from DataFrame
df = pd.DataFrame([1,6,7,3,4,9])
ls = [df]
ls 
'''or'''
df.axes

[RangeIndex(start=0, stop=6, step=1), RangeIndex(start=0, stop=1, step=1)]

In [20]:
#How to Reset the dataframes index?

In [21]:
#20. Write a Pandas program to count the number of rows and columns of a DataFrame
df = pd.DataFrame([1,2,6,9,7])
rows = len(df.axes[0])
columns = len(df.axes[1])
print(rows)
print(columns)

5
1

In [22]:
#21. Write a Pandas program to add, subtract, multiple, and divide two Pandas Series
Ser1 = pd.Series([1,2,3,6,9,7,4,20,14,10])
Ser2 = pd.Series([1,2,3,6,9,7,4,20,14,10])
def pandas_arithmatic(x,y):
    print("Addition is",list(np.add(Ser1,Ser2)))
    print("Substaction is",list(np.subtract(Ser1,Ser2)))
    print("Multiplication is",list(np.multiply(Ser1,Ser2)))
    print("Division is",list(np.divide(Ser1,Ser2)))
pandas_arithmatic(Ser1,Ser2)

Addition is [2, 4, 6, 12, 18, 14, 8, 40, 28, 20]
Substaction is [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
Multiplication is [1, 4, 9, 36, 81, 49, 16, 400, 196, 100]
Division is [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]

In [23]:
#22. Write a Pandas program to import excel data into a Pandas dataframe
data = pd.read_excel("Financial Sample.xlsx")
data

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,NaN,1618.5,3,20,32370.0,0.00,32370.00,16185.0,16185.00,2014-01-01,1,January,2014
1,Government,Germany,Carretera,NaN,1321.0,3,20,26420.0,0.00,26420.00,13210.0,13210.00,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,NaN,2178.0,3,15,32670.0,0.00,32670.00,21780.0,10890.00,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,NaN,888.0,3,15,13320.0,0.00,13320.00,8880.0,4440.00,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,NaN,2470.0,3,15,37050.0,0.00,37050.00,24700.0,12350.00,2014-06-01,6,June,2014
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
695,Small Business,France,Amarilla,High,2475.0,260,300,742500.0,111375.00,631125.00,618750.0,12375.00,2014-03-01,3,March,2014
696,Small Business,Mexico,Amarilla,High,546.0,260,300,163800.0,24570.00,139230.00,136500.0,2730.00,2014-10-01,10,October,2014
697,Government,Mexico,Montana,High,1368.0,5,7,9576.0,1436.40,8139.60,6840.0,1299.60,2014-02-01,2,February,2014
698,Government,Canada,Paseo,High,723.0,10,7,5061.0,759.15,4301.85,3615.0,686.85,2014-04-01,4,April,2014
699,Channel Partners,United States of America,VTT,High,1806.0,250,12,21672.0,3250.80,18421.20,5418.0,13003.20,2014-05-01,5,May,2014

In [24]:
# 23.Write a Pandas program to read specific columns from a given excel file

In [25]:
#24.Write a Pandas program to find the sum, mean, max, min value of
df = pd.DataFrame([1,3,9,7,8,10])
print("Sum is",df.sum())
print("Mean is",df.mean())
print("Maximum is",df.max())
print("Minimum is",df.min())

Sum is 0    38
dtype: int64
Mean is 0    6.333333
dtype: float64
Maximum is 0    10
dtype: int64
Minimum is 0    1
dtype: int64

In [30]:
#25. How Can A DataFrame Be Converted To An Excel File and CSV file?
indian_players = pd.DataFrame({'Name':['Rohit Sharma','Virat Kohli','Shikhar Dhawan','Rahul Dravid','Ms Dhoni'],'Runs':[1100,4500,9000,7041,11000],'Format':['Test','Odi','Test','Odi','Odi']},index=[1,2,3,4,5])
indian_players.to_csv('players data.csv')

In [31]:
pd.read_csv("players data.csv")

   Unnamed: 0            Name   Runs Format
0           1    Rohit Sharma   1100   Test
1           2     Virat Kohli   4500    Odi
2           3  Shikhar Dhawan   9000   Test
3           4    Rahul Dravid   7041    Odi
4           5        Ms Dhoni  11000    Odi